//заголовковий файл з бібліотекою функцій вводу-виводу
#include <iostream>
//заголовковий файл cmath містить математичні 
//функції, зокрема, pow(x,y)
#include <math.h>
//головна функція (програма)
int main() {
    //оголошення змінної дійсного типу
    /*стала пі*/ const float PI = 3.141593; 
    float a; //довжина ребра куба
    std::cin >> a;//інструкція вводу даних
    float v;//оголошення змінної для об'єму
    v = a * a * a;
/*змінні в С/С++ можна оголошувати будь-де
 в коді функції, але до їх використання*/
    float r3, r;
    r3 = 3 * v /(4 * PI);
    r = pow(r3, 1.0/3.0);
//вивід результату
    std::cout<<"Radius of ball "<<r<<std::endl;
	return 0;// у випадку успішного виконання програми 
// на C/C++ повертають значення 0
}
