#include <iostream>
using namespace std;
int main()
{
    cout<<"Введіть номер місяця:";
    int n, k=0;//значення k виводиться у будь-якому випадку
    //воно залишиться 0 при вводі неправильного номера
    cin >> n;
    switch(n)
    {
        case 2: k=28; break;
        /*мова C/C++ не дозволяє використовувати списки
     значень у пунктах вибору, але ось така конструкція:*/
        case 4: // буде виконано те, що й для 
        case 6: // міток 6, 9, 11, тобто код після
        case 9: // мітки 11
        case 11: k=30; break;
        //фактично реалізує      case 4,6,9,11: k=30; 
        case 1: case 3: case 5: case 7: case 8: case 10:
        case 12: k=31; break;
        default: cout<<"Нема такого місяця "; 
    }
    cout<<"Кількість днів: "<<k<<endl;
    return 0;
}
