#include <iostream>
using namespace std;

int main()
{
    int n;
    cout<<"Введіть натуральне число "
        <<"від 1 до 9999 включно\n";
    cin>>n;
    //первірка, чи користувач задав коректне число
    if (n > 0 && n<10000)
    {
        if(n < 10) cout<<n<<" - одноцифрове число\n";
        //одну інструкцію після if можна ставити без {}

        else 
        {
            if (n < 100)
            {
            //для зручного читання коду опрацювання
            //вітки розгалуження після if та else 
            //форматують, зазвичай, окремим блоком
                cout<<n<<" - двоцифрове число\n";
            }
            else 
            {
                if (n < 1000)
                {
                    cout<<n<<"  - трицифрове число.\n";
                }
                //else з однією командою можна писати так
                else cout<<n<<" - чотирицифрове число.\n";
            }
        }
    }
    else 
    {
        cout<<"Ви ввели число, що не належить "
                <<"вказаному відрізку\n";
    }
    return 0;
}
