visits = []#створюємо порожній список
print('Ведіть відвідуваність сайту', end=' ')
print('кожної години протягом доби')
for i in range(0,24):
    #дописуємо елементи в список
    visits.append(int(input(f'{i+1:02d}:00 >> ')))
s = 0
# цикл по елементрах списку
for k in visits :
    s+=k
a = s / 24
print(f'Середньодобова відвідуваність: {a:10.2f}')
print('Задайте коефіцієнт відхилення у % :')
p = float(input())
print(f'Години з не більше ніж {p:5.2f} -відсотковим')
print('відхиленням від сереньої відвідуваності:')
for i in range(0,24):
    if abs(visits[i]-a)<a*p/100 :
        print(i + 1) # Години номеруємо 1..24
