import math
# Створюємо порожній список, в який 
# записуватимемо рядки матриці  
p = []
#зовнішній цикл по рядках від 0 до 6
for i in range(0,7):
    #створюємо новий одновимірний масив для кожного
    #рядка матриці і записуємо в нього елементи 
    tmp = []
    for j in range(0,7):
        tmp.append(10*math.sin(3.0*(i+1))/(i + 1 + j + 1))
    p.append(tmp)
#Обчислення елементів масиву Q
q = []
for k in range(0,7):
    max = p[k][1]
    for j in range(0,7):
        if p[k][j] > max:
           max = p[k][j]
    min = p[1][k]
    for j in range(0,7):
        if p[j][k] < min:
            min = p[j][k]
    q.append( max - min )
print('Матриця P:')
# Для виводу елементів матриці скористаємося циклом
# типу foreach, який переглядає усі елементи списку
# зовнішній цикл записуватиме в змінну s 
# кожен рядок матриці по черзі
for s in p:
    # внутрішій цикл проходитиме кожен елемент
    # поточного рядка-списку s 
    for t in s:
        print('%10.3f'% t, end='')
    print()
#Вивід  масиву Q
print('Масив Q:')
for i in range(0, 7):
    print('%10.3f'% q[i], end='')
print()
