# використовуватимемо функцію randint
# з модуля random для генерування випадкового цілого числа
from random import randint

M = []  # в якості масиву використовуємо список
# елементи додаватимемо в процесі заповнення
k = int(input("Введіть число з відрізка [5;30]\nk = "))
for _ in range(100):
    M.append(randint(1, k))
# надрукуємо елементи масиву
print("Згенерований масив:\n", *M, sep=", ")
# створюємо список зі 100 порожніх множин
sets = []
for _ in range(100):
    sets.append(set())
# переглядаємо елементи масиву і записуємо в множини за правилом:
# елемент, що зустрівся вперше - в першу множину, якщо елемент вже є в першій множині - в другу, якщо є і в першій і в другій - в тертю і т. д.
# максимально можлива кількість мнижин при цьому - 100, в крайньому випадку, де масив заповнено одним і тим же елементом
for a in M:
    i = 0
    while True:
        if a in sets[i]:
            i += 1
        else:
            # якщо елемента нема в черговій множині, додаємо його в множину та завершуємо цикл перевірки
            sets[i].add(a)
            break
# шукаємо кількість заповнених множин
n = 0
while len(sets[n]) > 0:
    n += 1
# Вилучаємо з множин елементи, які містяться також і в наступних
for i in range(n - 1):
    sets[i] -= sets[i + 1]
for i in range(n):
    if len(sets[i]) > 0:
        print(f"Числа, які зустрічаються в списку {i+1} разів: {sets[i]}")
