def print_posix(q, n):
  if n < q :
    #число n в системі з основою q одноцифрове
    print(n, end='')
  else:
    #рекурсивний виклик функції для виводу старших 
    # розрядів числа
    print_posix(q, n // q)    
    print(n % q, end='') # виводимо останню цифру
    # числа n в системі числення з основою q
# Основна програма
m = int(input('Введіть число ціле : '))
print_posix(2, m) #вивід числа в двійковій системі
print('(2) = ', end='')
print_posix(3, m) # вивід числа в трійковій системі
print('(3) = ', end='')
print_posix(7, m) # вивід числа в сімковій системі
print('(7) = ', end='')
print(m, '(10)')