program task60;
{Запрограмувати обчислення виразу за заданими формулами для введених користувачем вхідних даних}
var p,u,v,x,y:real;
begin
	write('x = ');
	readln(x);
	write('y = ');
	readln(y);
	u := cos(x) + sin(y);
	v := exp((3*x)*ln(y)) + exp((5*y)*ln(x));
	p:= abs(exp(u*u) + 
		exp(-3*u))/(ln(v)/ln(3));
	{ p:12:5 вказує, що дійсне число p при виводі на
	екран потрібно показати з 5-ма цифрами після
	коми, а всього для виводу числа p використати 
	12 знаків, включно з пробілами на початку}
	writeln('Expression value: p = ',p:12:5);
end.
