program Task300;
var visits:array[1..24] of  integer;{оглошуємо масив}
    s, i: integer; a, p: real;
begin
    write('Ведіть відвідуваність сайту ');
    writeln('кожної години протягом доби');
    {вводимо елементи масиву в циклі}
    for i:=1 to 24 do
    read(visits[i]);
    {функція read дозволяє також читати числа, 
       введені в одну стрічку через пробіл}
    s := 0;
    {цикл по елементах списку}
    for i:=1 to 24 do s:= s + visits[i];
    a := s / 24;
    writeln('Середньодобова відвідуваність', a:10:2);
    writeln('Задайте коефіцієнт відхилення у % :');
    readln(p);
    writeln('Години з менш, ніж ', p:5:2,' -');
    writeln(' відсотковим відхиленням від ');
    writeln('середньої відвідуваності:');
    for i:=1 to 24 do
        if abs(visits[i]-a) < a*p/100 then
            writeln(i)
    {розгалуження в циклі є одним оператором,
    тому операторні дужки "begin" та "end" не потрібні}
end.
