fun main() {
    val PI = 3.141593
    var a: Double //довжина ребра куба
    println("Введіть дожину ребра куба")
    //інструкція вводу дійсного чиcла
    a = readln().toDouble()
    var v: Double //оголошення змінної для об'єму
    v = a * a * a
    val r: Double
    val r3 = 3 * v / (4 * PI)
    /* усі математичні функції, в тому числі, піднесення
    до степеня є статичними методами бібліотечного класу
    Math, з пакету Java Development Kit*/
    r = java.lang.Math.pow(r3, 1.0 / 3.0)
    //вивід результату p 5-ма знаками після коми
    println("Радіус кулі %10.5f".format(r))
}
