fun main(args: Array<String>) {
    println("Введіть натуральне число від 1 до 9999" )
    val n: Int = readln().toInt()
    //первірка, чи користувач ввів коректне число
    // можна використовувати таку перевірку належності
    // числа діапазону замість n > 0 && n<10000
    if (n in 1..9999) {
        if (n < 10) {
            println("%5d - одноцифрове число".format(n))
        }else if (n < 100) {
            println("%5d - двоцифрове число".format(n))
        } else if (n < 1000) {
            println("%5d - трицифрове число".format(n))
        } else {
            println("%5d - чотирицифрове число".format(n))
        }
    } else {
        println("Ви ввели число, " +
                "що не належить вказаному відрізку")
    }
}
