import kotlin.math.abs

fun main() {
    //оглошуємо масив та створюємо його
    val visits = IntArray(24)
    println( "Ведіть відвідуваність " +
            "сайту кожної години протягом доби" )
    //вводимо елементи масиву в циклі
    for (i in 0..23) {
        visits[i] = readln().toInt()
    }
    var s = 0
    //цикл по елементах списку
    for (i in 0..23) {
        s += visits[i]
    }
    val a = s.toDouble() / 24
    //приводимо s до дійсного типу
    //інакше буде виконуватися ділення націло
    println("Добова відвідуваність " +
            "%.2f відвідувачів на годину.".format(a))
    println("Задайте відхилення у %")
    val p = readln().toDouble()
    println("Години з менш, ніж " + p +
            "-відсотковим відхиленням від " +
            "середньої відвідуваності:")
    for (i in 0..23) {
        if (abs(visits[i] - a) < a * p / 100) {
            // години номеруємо 1..24
            print(" %3d".format(i + 1))
        }
    }
}